bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA16HVB.xml
            <module name="CHARGER_DETECT">
                <instance name="CHARGER_DETECT" caption="Charger Detect">
                    <register-group name="CHARGER_DETECT" name-in-module="CHARGER_DETECT" offset="0x00"
                                    address-space="data" caption="Charger Detect"/>
                </instance>
            </module>
            <module name="VOLTAGE_REGULATOR">
                <instance name="VOLTAGE_REGULATOR" caption="Voltage Regulator">
                    <register-group name="VOLTAGE_REGULATOR" name-in-module="VOLTAGE_REGULATOR" offset="0x00"
                                    address-space="data" caption="Voltage Regulator"/>
                </instance>
            </module>
            <module name="BANDGAP">
                <instance name="BANDGAP" caption="Bandgap">
                    <register-group name="BANDGAP" name-in-module="BANDGAP" offset="0x00" address-space="data"
                                    caption="Bandgap"/>
                </instance>
            </module>
            <module name="CPU">
                <instance name="CPU" caption="CPU Registers">
                    <register-group name="CPU" name-in-module="CPU" offset="0x00" address-space="data"
                                    caption="CPU Registers"/>
                    <parameters>
                        <param name="CORE_VERSION" value="V2E"/>
                    </parameters>
                </instance>
            </module>
            <module name="PORT">
                <instance name="PORTA" caption="I/O Port">
                    <register-group name="PORTA" name-in-module="PORTA" offset="0x00" address-space="data"
                                    caption="I/O Port"/>
                </instance>
                <instance name="PORTB" caption="I/O Port">
                    <register-group name="PORTB" name-in-module="PORTB" offset="0x00" address-space="data"
                                    caption="I/O Port"/>
                </instance>
                <instance name="PORTC" caption="I/O Port">
                    <register-group name="PORTC" name-in-module="PORTC" offset="0x00" address-space="data"
                                    caption="I/O Port"/>
                </instance>
            </module>
            <module name="BOOT_LOAD">
                <instance name="BOOT_LOAD" caption="Bootloader">
                    <register-group name="BOOT_LOAD" name-in-module="BOOT_LOAD" offset="0x00" address-space="data"
                                    caption="Bootloader"/>
                </instance>
            </module>
            <module name="FUSE">
                <instance name="FUSE" caption="Fuses">
                    <register-group name="FUSE" name-in-module="FUSE" offset="0" address-space="fuses"
                                    caption="Fuses"/>
                </instance>
            </module>
            <module name="LOCKBIT">
                <instance name="LOCKBIT" caption="Lockbits">
                    <register-group name="LOCKBIT" name-in-module="LOCKBIT" offset="0" address-space="lockbits"
                                    caption="Lockbits"/>
                </instance>
            </module>
        </peripherals>
        <interrupts>
            <interrupt index="0" name="RESET"
                       caption="External Pin, Power-on Reset, Brown-out Reset and Watchdog Reset"/>
            <interrupt index="1" name="BPINT" caption="Battery Protection Interrupt"/>
            <interrupt index="2" name="VREGMON" caption="Voltage regulator monitor interrupt"/>
            <interrupt index="3" name="INT0" caption="External Interrupt Request 0"/>
            <interrupt index="4" name="INT1" caption="External Interrupt Request 1"/>
            <interrupt index="5" name="INT2" caption="External Interrupt Request 2"/>
            <interrupt index="6" name="INT3" caption="External Interrupt Request 3"/>
            <interrupt index="7" name="PCINT0" caption="Pin Change Interrupt 0"/>
            <interrupt index="8" name="PCINT1" caption="Pin Change Interrupt 1"/>
            <interrupt index="9" name="WDT" caption="Watchdog Timeout Interrupt"/>
            <interrupt index="10" name="BGSCD" caption="Bandgap Buffer Short Circuit Detected"/>
            <interrupt index="11" name="CHDET" caption="Charger Detect"/>
            <interrupt index="12" name="TIMER1_IC" caption="Timer 1 Input capture"/>
            <interrupt index="13" name="TIMER1_COMPA" caption="Timer 1 Compare Match A"/>
            <interrupt index="14" name="TIMER1_COMPB" caption="Timer 1 Compare Match B"/>
            <interrupt index="15" name="TIMER1_OVF" caption="Timer 1 overflow"/>
            <interrupt index="16" name="TIMER0_IC" caption="Timer 0 Input Capture"/>
            <interrupt index="17" name="TIMER0_COMPA" caption="Timer 0 Comapre Match A"/>
            <interrupt index="18" name="TIMER0_COMPB" caption="Timer 0 Compare Match B"/>
            <interrupt index="19" name="TIMER0_OVF" caption="Timer 0 Overflow"/>
            <interrupt index="20" name="TWIBUSCD" caption="Two-Wire Bus Connect/Disconnect"/>
            <interrupt index="21" name="TWI" caption="Two-Wire Serial Interface"/>
            <interrupt index="22" name="SPI_STC" caption="SPI Serial transfer complete"/>
            <interrupt index="23" name="VADC" caption="Voltage ADC Conversion Complete"/>
            <interrupt index="24" name="CCADC_CONV" caption="Coulomb Counter ADC Conversion Complete"/>
            <interrupt index="25" name="CCADC_REG_CUR" caption="Coloumb Counter ADC Regular Current"/>
            <interrupt index="26" name="CCADC_ACC" caption="Coloumb Counter ADC Accumulator"/>
            <interrupt index="27" name="EE_READY" caption="EEPROM Ready"/>
            <interrupt index="28" name="SPM" caption="SPM Ready"/>
        </interrupts>
        <interfaces>
            <interface name="ISP" type="isp"/>
            <interface name="HVPP" type="hvpp"/>
            <interface name="debugWIRE" type="dw"/>
        </interfaces>
        <property-groups>
            <property-group name="SIGNATURES">
                <property name="JTAGID" value="0x940D"/>
                <property name="SIGNATURE0" value="0x1e"/>
                <property name="SIGNATURE1" value="0x94"/>
                <property name="SIGNATURE2" value="0x0d"/>
            </property-group>
            <property-group name="OCD">
                <property name="OCD_REVISION" value="1"/>
                <property name="OCD_DATAREG" value="0x31"/>
                <property name="PROGBASE" value="0x0000"/>
            </property-group>
            <property-group name="JTAG_INTERFACE">
                <property name="ALLOWFULLPAGESTREAM" value="0x00"/>
            </property-group>
            <property-group name="ISP_INTERFACE">
                <property name="IspEnterProgMode_timeout" value="200"/>
                <property name="IspEnterProgMode_stabDelay" value="100"/>
                <property name="IspEnterProgMode_cmdexeDelay" value="25"/>
                <property name="IspEnterProgMode_synchLoops" value="32"/>
                <property name="IspEnterProgMode_byteDelay" value="0"/>
                <property name="IspEnterProgMode_pollIndex" value="3"/>
                <property name="IspEnterProgMode_pollValue" value="0x53"/>
                <property name="IspLeaveProgMode_preDelay" value="1"/>
                <property name="IspLeaveProgMode_postDelay" value="1"/>
                <property name="IspChipErase_eraseDelay" value="45"/>
                <property name="IspChipErase_pollMethod" value="1"/>
                <property name="IspProgramFlash_mode" value="0x41"/>
                <property name="IspProgramFlash_blockSize" value="128"/>
                <property name="IspProgramFlash_delay" value="10"/>
                <property name="IspProgramFlash_cmd1" value="0x40"/>
                <property name="IspProgramFlash_cmd2" value="0x4C"/>
                <property name="IspProgramFlash_cmd3" value="0x00"/>
                <property name="IspProgramFlash_pollVal1" value="0x00"/>
                <property name="IspProgramFlash_pollVal2" value="0x00"/>
                <property name="IspProgramEeprom_mode" value="0x41"/>
                <property name="IspProgramEeprom_blockSize" value="4"/>
                <property name="IspProgramEeprom_delay" value="10"/>
                <property name="IspProgramEeprom_cmd1" value="0xC1"/>
                <property name="IspProgramEeprom_cmd2" value="0xC2"/>
                <property name="IspProgramEeprom_cmd3" value="0x00"/>
                <property name="IspProgramEeprom_pollVal1" value="0x00"/>
                <property name="IspProgramEeprom_pollVal2" value="0x00"/>
                <property name="IspReadFlash_blockSize" value="256"/>
                <property name="IspReadEeprom_blockSize" value="256"/>
                <property name="IspReadFuse_pollIndex" value="4"/>
                <property name="IspReadLock_pollIndex" value="4"/>
                <property name="IspReadSign_pollIndex" value="4"/>
                <property name="IspReadOsccal_pollIndex" value="4"/>
            </property-group>
            <property-group name="PP_INTERFACE">
                <property name="PpControlStack"
                          value="0x0E 0x1E 0x0F 0x1F 0x2E 0x3E 0x2F 0x3F 0x4E 0x5E 0x4F 0x5F 0x6E 0x7E 0x6F 0x7F 0x66 0x76 0x67 0x77 0x6A 0x7A 0x6B 0x7B 0xBE 0xFD 0x00 0x01 0x00 0x00 0x00 0x00"/>
                <property name="PpEnterProgMode_stabDelay" value="100"/>
                <property name="PpEnterProgMode_progModeDelay" value="0"/>
                <property name="PpEnterProgMode_latchCycles" value="6"/>
                <property name="PpEnterProgMode_toggleVtg" value="0"/>
                <property name="PpEnterProgMode_powerOffDelay" value="0"/>
                <property name="PpEnterProgMode_resetDelayMs" value="0"/>
                <property name="PpEnterProgMode_resetDelayUs" value="0"/>
                <property name="PpLeaveProgMode_stabDelay" value="15"/>
                <property name="PpLeaveProgMode_resetDelay" value="15"/>
                <property name="PpChipErase_pulseWidth" value="0"/>
                <property name="PpChipErase_pollTimeout" value="10"/>
                <property name="PpProgramFlash_pollTimeout" value="5"/>
                <property name="PpProgramFlash_mode" value="0x0F"/>
                <property name="PpProgramFlash_blockSize" value="256"/>
                <property name="PpReadFlash_blockSize" value="256"/>
                <property name="PpProgramEeprom_pollTimeout" value="5"/>
                <property name="PpProgramEeprom_mode" value="0x05"/>
                <property name="PpProgramEeprom_blockSize" value="256"/>
                <property name="PpReadEeprom_blockSize" value="256"/>
                <property name="PpProgramFuse_pulseWidth" value="0"/>
                <property name="PpProgramFuse_pollTimeout" value="5"/>
                <property name="PpProgramLock_pulseWidth" value="0"/>
                <property name="PpProgramLock_pollTimeout" value="5"/>
            </property-group>
            <property-group name="ISP_INTERFACE_STK600">
                <property name="IspEnterProgMode_timeout" value="200"/>
                <property name="IspEnterProgMode_stabDelay" value="100"/>
                <property name="IspEnterProgMode_cmdexeDelay" value="25"/>
                <property name="IspEnterProgMode_synchLoops" value="32"/>
                <property name="IspEnterProgMode_byteDelay" value="0"/>
                <property name="IspEnterProgMode_pollIndex" value="3"/>
                <property name="IspEnterProgMode_pollValue" value="0x53"/>
                <property name="IspLeaveProgMode_preDelay" value="1"/>
                <property name="IspLeaveProgMode_postDelay" value="1"/>
                <property name="IspChipErase_eraseDelay" value="45"/>
                <property name="IspChipErase_pollMethod" value="1"/>
                <property name="IspProgramFlash_mode" value="0x41"/>
                <property name="IspProgramFlash_blockSize" value="128"/>
                <property name="IspProgramFlash_delay" value="6"/>
                <property name="IspProgramFlash_cmd1" value="0x40"/>
                <property name="IspProgramFlash_cmd2" value="0x4C"/>
                <property name="IspProgramFlash_cmd3" value="0x00"/>
                <property name="IspProgramFlash_pollVal1" value="0x00"/>
                <property name="IspProgramFlash_pollVal2" value="0x00"/>
                <property name="IspProgramEeprom_mode" value="0x41"/>
                <property name="IspProgramEeprom_blockSize" value="4"/>
                <property name="IspProgramEeprom_delay" value="10"/>
                <property name="IspProgramEeprom_cmd1" value="0xC1"/>
                <property name="IspProgramEeprom_cmd2" value="0xC2"/>
                <property name="IspProgramEeprom_cmd3" value="0x00"/>
                <property name="IspProgramEeprom_pollVal1" value="0x00"/>
                <property name="IspProgramEeprom_pollVal2" value="0x00"/>
                <property name="IspReadFlash_blockSize" value="256"/>
                <property name="IspReadEeprom_blockSize" value="256"/>
                <property name="IspReadFuse_pollIndex" value="4"/>
                <property name="IspReadLock_pollIndex" value="4"/>
                <property name="IspReadSign_pollIndex" value="4"/>
                <property name="IspReadOsccal_pollIndex" value="4"/>
            </property-group>
            <property-group name="PP_INTERFACE_STK600">
                <property name="PpControlStack"
                          value="0x0E 0x1E 0x0F 0x1F 0x2E 0x3E 0x2F 0x3F 0x4E 0x5E 0x4F 0x5F 0x6E 0x7E 0x6F 0x7F 0x66 0x76 0x67 0x77 0x6A 0x7A 0x6B 0x7B 0xBE 0xFD 0x00 0x01 0x00 0x00 0x00 0x00"/>
                <property name="PpEnterProgMode_stabDelay" value="100"/>
                <property name="PpEnterProgMode_progModeDelay" value="0"/>
                <property name="PpEnterProgMode_latchCycles" value="6"/>
                <property name="PpEnterProgMode_toggleVtg" value="1"/>
                <property name="PpEnterProgMode_powerOffDelay" value="20"/>
                <property name="PpEnterProgMode_resetDelayMs" value="0"/>
                <property name="PpEnterProgMode_resetDelayUs" value="50"/>
                <property name="PpLeaveProgMode_stabDelay" value="15"/>
                <property name="PpLeaveProgMode_resetDelay" value="15"/>
                <property name="PpChipErase_pulseWidth" value="0"/>
                <property name="PpChipErase_pollTimeout" value="10"/>
                <property name="PpProgramFlash_pollTimeout" value="5"/>
                <property name="PpProgramFlash_mode" value="0x0F"/>
                <property name="PpProgramFlash_blockSize" value="256"/>
                <property name="PpReadFlash_blockSize" value="256"/>
                <property name="PpProgramEeprom_pollTimeout" value="5"/>
                <property name="PpProgramEeprom_mode" value="0x05"/>
                <property name="PpProgramEeprom_blockSize" value="256"/>
                <property name="PpReadEeprom_blockSize" value="256"/>
                <property name="PpProgramFuse_pulseWidth" value="0"/>
                <property name="PpProgramFuse_pollTimeout" value="5"/>
                <property name="PpProgramLock_pulseWidth" value="0"/>
                <property name="PpProgramLock_pollTimeout" value="5"/>
            </property-group>
        </property-groups>
    </device>
    <modules>
        <module caption="Fuses" name="FUSE">
            <register-group caption="Fuses" name="FUSE">
                <register caption="" name="LOW" offset="0x00" size="1" initval="0xDD">
                    <bitfield caption="Watch-dog Timer always on" mask="0x80" name="WDTON"/>
                    <bitfield caption="Preserve EEPROM through the Chip Erase cycle" mask="0x40" name="EESAVE"/>
                    <bitfield caption="Serial program downloading (SPI) enabled" mask="0x20" name="SPIEN"/>
                    <bitfield caption="Select start-up time" mask="0x1C" name="SUT" values="ENUM_SUT"/>
                    <bitfield caption="Oscillator select" mask="0x03" name="OSCSEL" values="ENUM_OSCSEL"/>
                </register>
                <register caption="" name="HIGH" offset="0x01" size="1" initval="0xE9">
                    <bitfield caption="Clock Divide mode" mask="0x10" name="CKDIV8"/>
                    <bitfield caption="Debug Wire enable" mask="0x08" name="DWEN"/>
                    <bitfield caption="Select Boot Size" mask="0x06" name="BOOTSZ" values="ENUM_BOOTSZ"/>
                    <bitfield caption="Boot Reset vector Enabled" mask="0x01" name="BOOTRST"/>
                </register>
            </register-group>
            <value-group caption="" name="ENUM_SUT">
                <value caption="Start-up time 14 CK + 4 ms" name="14CK_4MS" value="0x00"/>
                <value caption="Start-up time 14 CK + 8 ms" name="14CK_8MS" value="0x01"/>
                <value caption="Start-up time 14 CK + 16 ms" name="14CK_16MS" value="0x02"/>
                <value caption="Start-up time 14 CK + 32 ms" name="14CK_32MS" value="0x03"/>
                <value caption="Start-up time 14 CK + 64 ms" name="14CK_64MS" value="0x04"/>
                <value caption="Start-up time 14 CK + 128 ms" name="14CK_128MS" value="0x05"/>
                <value caption="Start-up time 14 CK + 256 ms" name="14CK_256MS" value="0x06"/>
                <value caption="Start-up time 14 CK + 512 ms" name="14CK_512MS" value="0x07"/>
            </value-group>
            <value-group caption="" name="ENUM_OSCSEL">
                <value caption="Default" name="DEFAULT" value="0x01"/>
            </value-group>
